exampleCases/example.1.piso.NREL5MW.ADM/constant/airfoilProperties/DU25_A17
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.6                                   |
|   \\  /    A nd           | Web:      http://www.OpenFOAM.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      airfoilProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

airfoilData
(
//   alpha   C_l    C_d
     (-180.00    0.000   0.0202)
     (-175.00    0.368   0.0324)
     (-170.00    0.735   0.0943)
     (-160.00    0.695   0.2848)
     (-155.00    0.777   0.4001)
     (-150.00    0.828   0.5215)
     (-145.00    0.850   0.6447)
     (-140.00    0.846   0.7660)
     (-135.00    0.818   0.8823)
     (-130.00    0.771   0.9911)
     (-125.00    0.705   1.0905)
     (-120.00    0.624   1.1787)
     (-115.00    0.530   1.2545)
     (-110.00    0.426   1.3168)
     (-105.00    0.314   1.3650)
     (-100.00    0.195   1.3984)
     ( -95.00    0.073   1.4169)
     ( -90.00   -0.050   1.4201)
     ( -85.00   -0.173   1.4081)
     ( -80.00   -0.294   1.3811)
     ( -75.00   -0.409   1.3394)
     ( -70.00   -0.518   1.2833)
     ( -65.00   -0.617   1.2138)
     ( -60.00   -0.706   1.1315)
     ( -55.00   -0.780   1.0378)
     ( -50.00   -0.839   0.9341)
     ( -45.00   -0.879   0.8221)
     ( -40.00   -0.898   0.7042)
     ( -35.00   -0.893   0.5829)
     ( -30.00   -0.862   0.4616)
     ( -25.00   -0.803   0.3441)
     ( -24.00   -0.792   0.3209)
     ( -23.00   -0.789   0.2972)
     ( -22.00   -0.792   0.2730)
     ( -21.00   -0.801   0.2485)
     ( -20.00   -0.815   0.2237)
     ( -19.00   -0.833   0.1990)
     ( -18.00   -0.854   0.1743)
     ( -17.00   -0.879   0.1498)
     ( -16.00   -0.905   0.1256)
     ( -15.00   -0.932   0.1020)
     ( -14.00   -0.959   0.0789)
     ( -13.00   -0.985   0.0567)
     ( -13.00   -0.985   0.0567)
     ( -12.01   -0.953   0.0271)
     ( -11.00   -0.900   0.0303)
     (  -9.98   -0.827   0.0287)
     (  -8.98   -0.753   0.0271)
     (  -8.47   -0.691   0.0264)
     (  -7.45   -0.555   0.0114)
     (  -6.42   -0.413   0.0094)
     (  -5.40   -0.271   0.0086)
     (  -5.00   -0.220   0.0073)
     (  -4.50   -0.152   0.0071)
     (  -4.00   -0.084   0.0070)
     (  -3.50   -0.018   0.0069)
     (  -3.00    0.049   0.0068)
     (  -2.50    0.115   0.0068)
     (  -2.00    0.181   0.0068)
     (  -1.50    0.247   0.0067)
     (  -1.00    0.312   0.0067)
     (  -0.50    0.377   0.0067)
     (   0.00    0.444   0.0065)
     (   0.50    0.508   0.0065)
     (   1.00    0.573   0.0066)
     (   1.50    0.636   0.0067)
     (   2.00    0.701   0.0068)
     (   2.50    0.765   0.0069)
     (   3.00    0.827   0.0070)
     (   3.50    0.890   0.0071)
     (   4.00    0.952   0.0073)
     (   4.50    1.013   0.0076)
     (   5.00    1.062   0.0079)
     (   6.00    1.161   0.0099)
     (   6.50    1.208   0.0117)
     (   7.00    1.254   0.0132)
     (   7.50    1.301   0.0143)
     (   8.00    1.336   0.0153)
     (   8.50    1.369   0.0165)
     (   9.00    1.400   0.0181)
     (   9.50    1.428   0.0211)
     (  10.00    1.442   0.0262)
     (  10.50    1.427   0.0336)
     (  11.00    1.374   0.0420)
     (  11.50    1.316   0.0515)
     (  12.00    1.277   0.0601)
     (  12.50    1.250   0.0693)
     (  13.00    1.246   0.0785)
     (  13.50    1.247   0.0888)
     (  14.00    1.256   0.1000)
     (  14.50    1.260   0.1108)
     (  15.00    1.271   0.1219)
     (  15.50    1.281   0.1325)
     (  16.00    1.289   0.1433)
     (  16.50    1.294   0.1541)
     (  17.00    1.304   0.1649)
     (  17.50    1.309   0.1754)
     (  18.00    1.315   0.1845)
     (  18.50    1.320   0.1953)
     (  19.00    1.330   0.2061)
     (  19.50    1.343   0.2170)
     (  20.00    1.354   0.2280)
     (  20.50    1.359   0.2390)
     (  21.00    1.360   0.2536)
     (  22.00    1.325   0.2814)
     (  23.00    1.288   0.3098)
     (  24.00    1.251   0.3386)
     (  25.00    1.215   0.3678)
     (  26.00    1.181   0.3972)
     (  28.00    1.120   0.4563)
     (  30.00    1.076   0.5149)
     (  32.00    1.056   0.5720)
     (  35.00    1.066   0.6548)
     (  40.00    1.064   0.7901)
     (  45.00    1.035   0.9190)
     (  50.00    0.980   1.0378)
     (  55.00    0.904   1.1434)
     (  60.00    0.810   1.2333)
     (  65.00    0.702   1.3055)
     (  70.00    0.582   1.3587)
     (  75.00    0.456   1.3922)
     (  80.00    0.326   1.4063)
     (  85.00    0.197   1.4042)
     (  90.00    0.072   1.3985)
     (  95.00   -0.050   1.3973)
     ( 100.00   -0.170   1.3810)
     ( 105.00   -0.287   1.3498)
     ( 110.00   -0.399   1.3041)
     ( 115.00   -0.502   1.2442)
     ( 120.00   -0.596   1.1709)
     ( 125.00   -0.677   1.0852)
     ( 130.00   -0.743   0.9883)
     ( 135.00   -0.792   0.8818)
     ( 140.00   -0.821   0.7676)
     ( 145.00   -0.826   0.6481)
     ( 150.00   -0.806   0.5264)
     ( 155.00   -0.758   0.4060)
     ( 160.00   -0.679   0.2912)
     ( 170.00   -0.735   0.0995)
     ( 175.00   -0.368   0.0356)
     ( 180.00    0.000   0.0202)
);
