exampleCases/example.1.piso.NREL5MW.ADM/constant/turbineArrayProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbineProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

globalProperties
{
    outputControl       "timeStep";
//  outputControl       "runTime";
    outputInterval       1;
}


turbine0
{
    turbineType         "NREL5MWRef";
    baseLocation        (500.0  500.0 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}

turbine1
{
    turbineType         "NREL5MWRef";
    baseLocation        (1000.0 500.0 0.0);
    nRadial              64;
    azimuthMaxDis        2.0;
    nAvgSector           1;
    pointDistType       "uniform";
    pointInterpType     "linear";
    bladeUpdateType     "oldPosition";
    epsilon              20.0;
    forceScalar          1.0;
    inflowVelocityScalar 0.94;
    tipRootLossCorrType "Glauert";
    rotationDir         "cw";
    Azimuth              0.0;
    RotSpeed             9.15519863;
    TorqueGen            0.0;
    Pitch                0.0;
    NacYaw             270.0;
    fluidDensity         1.225;
}